Notas de Clases/Compleja/temario-compleja-3.org
#+author: Carlos Eduardo Martínez Aguilar
#+title: Temario de Variable Compleja 3.
#+LANGUAGE: esp
#+OPTIONS: tex:t
#+SETUPFILE: ~/Templates/latex-export.org

\noindent *PROPUESTA DE TEMARIO*
1. Funciones El'ipticas
   - Funciones simplemete peri'odicas y sus series de Fourier.
   - Funciones doblemente peri'odicas y su latiz de periodos.
   - Bases can'onicas y el grupo modular.
   - La teor'ia de Weierstrass y la funci'on $\wp$.
   - La funci'on modular $\lambda$.

2. Formas Modulares
   - El orbifold modular.
   - Series de Einsenstein.
   - El anillo de formas modulares.

3. Curvas elipt'icas
   - El conjunto soluci'on a $y^2=4x^3-g_2x-g_3$ y sus propiedad geometrico algebraicas.
   - Parametrizaci'on con la funci'on $\wp$.
   - Las curvas el'ipticas como toros.

4. Superficies de Riemann
   - Cartas holomorfas y funciones holomorfas en superficies.
   - Ejemplos de superficies de Riemann.
   - El plano proyectivo y curvas algebraicas.

5. Uniformización de superficies de Riemann
   - Repaso del teorema de mapo de Riemann.
   - Mapeos conformes en polinomios y la fórmula de Schwarz-Christoffel.
   - Métricas Riemannianas en superficies.
   - El espacio hiperbólico y sus cosientes.
   - Lema de weyl.
   - Teorema de Uniformzación.

*Bibliografía*:

- L.V. Ahlfors ``Complex Analysis'', McGraw-Hill, Tokyo.
- S. Donaldson ``Riemann Surfaces'', Oxford Graduate Text In Mathematics, London, 2011.
