Notas de Clases/Compleja/temario-compleja-3.tex
% Created 2025-03-19 Wed 17:51
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern} % Ensures we have the right font
\usepackage[utf8]{inputenc}
\usepackage{graphicx}
\usepackage{amsmath, amsthm, amssymb, amsfonts, amssymb, amscd}
\usepackage[table, xcdraw]{xcolor}
%\usepackage{mdsymbol}
\usepackage{tikz-cd}
\usepackage{float}
\usepackage[spanish, activeacute, ]{babel}
\usepackage{color}
\usepackage{transparent}
\graphicspath{{./figs/}}
\usepackage{makeidx}
\usepackage{afterpage}
\usepackage{array}
\usepackage{braket}
\usepackage{pst-node}
\newtheorem{teorema}{Teorema}[section]
\newtheorem{prop}[teorema]{Proposici\'on}
\newtheorem{cor}[teorema]{Corolario}
\newtheorem{lema}[teorema]{Lema}
\newtheorem{def.}{Definici\'on}[section]
\newtheorem{afir}{Afirmaci\'on}
\newtheorem{conjetura}{Conjetura}
\renewcommand{\figurename}{Figura}
\renewcommand{\indexname}{\'{I}ndice anal\'{\i}tico}
\newcommand{\zah}{\ensuremath{ \mathbb Z }}
\newcommand{\rac}{\ensuremath{ \mathbb Q }}
\newcommand{\nat}{\ensuremath{ \mathbb N }}
\newcommand{\prob}{\textbf{P}}
\newcommand{\esp}{\mathbb E}
\newcommand{\eje}{{\newline \noindent \sc \textbf{Ejemplo. }}}
\newcommand{\obs}{{\newline \noindent \sc \textbf{Observación. }}}
\newcommand{\dem}{{\noindent \sc Demostraci\'on. }}
\newcommand{\bg}{\ensuremath{\overline \Gamma}}
\newcommand{\ga}{\ensuremath{\gamma}}
\newcommand{\fb}{\ensuremath{\overline F}}
\newcommand{\la}{\ensuremath{\Lambda}}
\newcommand{\om}{\ensuremath{\Omega}}
\newcommand{\sig}{\ensuremath{\Sigma}}
\newcommand{\bt}{\ensuremath{\overline T}}
\newcommand{\li}{\ensuremath{\mathbb{L}}}
\newcommand{\ord}{\ensuremath{\mathbb{O}}}
\newcommand{\bs}{\ensuremath{\mathbb{S}^1}}
\newcommand{\co}{\ensuremath{\mathbb C }}
\newcommand{\con}{\ensuremath{\mathbb{C}^n}}
\newcommand{\cp}{\ensuremath{\mathbb{CP}}}
\newcommand{\rp}{\ensuremath{\mathbb{RP}}}
\newcommand{\re}{\ensuremath{\mathbb R }}
\newcommand{\hc}{\ensuremath{\widehat{\mathbb C} }}
\newcommand{\pslz}{\ensuremath{\mathrm{PSL}(2,\mathbb Z) }}
\newcommand{\pslr}{\ensuremath{\mathrm{PSL}(2,\mathbb R) }}
\newcommand{\pslc}{\ensuremath{\mathrm{PSL}(2,\mathbb C) }}
\newcommand{\hd}{\ensuremath{\mathbb H^2}}
\newcommand{\slz}{\ensuremath{\mathrm{SL}(2,\mathbb Z) }}
\newcommand{\slr}{\ensuremath{\mathrm{SL}(2,\mathbb R) }}
\newcommand{\slc}{\ensuremath{\mathrm{SL}(2,\mathbb C) }}
\newcommand{\mdlr}{\ensuremath{\mathrm{M}}}
\title{Temario de Variable Compleja 3. Latex Export}
\hypersetup{
 pdftitle={Temario de Variable Compleja 3. Latex Export},
 pdfkeywords={},
 pdfsubject={},
 pdflang={Esp}}
\begin{document}

\maketitle

\noindent \textbf{PROPUESTA DE TEMARIO}
\begin{enumerate}
\item Funciones El'ipticas
\begin{itemize}
\item Funciones simplemete peri'odicas y sus series de Fourier.
\item Funciones doblemente peri'odicas y su latiz de periodos.
\item Bases can'onicas y el grupo modular.
\item La teor'ia de Weierstrass y la funci'on \(\wp\).
\item La funci'on modular \(\lambda\).
\end{itemize}

\item Formas Modulares
\begin{itemize}
\item El orbifold modular.
\item Series de Einsenstein.
\item El anillo de formas modulares.
\end{itemize}

\item Curvas elipt'icas
\begin{itemize}
\item El conjunto soluci'on a \(y^2=4x^3-g_2x-g_3\) y sus propiedad geometrico algebraicas.
\item Parametrizaci'on con la funci'on \(\wp\).
\item Las curvas el'ipticas como toros.
\end{itemize}

\item Superficies de Riemann
\begin{itemize}
\item Cartas holomorfas y funciones holomorfas en superficies.
\item Ejemplos de superficies de Riemann.
\item El plano proyectivo y curvas algebraicas.
\end{itemize}

\item Uniformización de superficies de Riemann
\begin{itemize}
\item Repaso del teorema de mapo de Riemann.
\item Mapeos conformes en polinomios y la fórmula de Schwarz-Christoffel.
\item Métricas Riemannianas en superficies.
\item El espacio hiperbólico y sus cosientes.
\item Lema de weyl.
\item Teorema de Uniformzación.
\end{itemize}
\end{enumerate}

\textbf{Bibliografía}:

\begin{itemize}
\item L.V. Ahlfors ``Complex Analysis'', McGraw-Hill, Tokyo.
\item S. Donaldson ``Riemann Surfaces'', Oxford Graduate Text In Mathematics, London, 2011.
\end{itemize}
\end{document}
